---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsConstructionMethod
source: html/baaba95a-8e1d-d002-2431-baaef362f060.htm
---
# Autodesk.Revit.DB.Architecture.StairsConstructionMethod

Represents the construction method of the stairs.

## Syntax (C#)
```csharp
public enum StairsConstructionMethod
```